### Step:1 - Merge all the monthly data into one file per year from 2014 to 2017

In [25]:
#merge all monthly files into one file

import os
import sys
import pandas as pd
import numpy as np

# merge from a folder 

def merge_files(folder, output_file):
    files = os.listdir(folder)

    # starts with 'OD_'
    files = [f for f in files if f.startswith('OD_')]
    files.sort()
    print(files)
    df = pd.read_csv(folder + '/' + files[0])
    for f in files[1:]:
        df = pd.concat([df, pd.read_csv(folder + '/' + f)], ignore_index=True)
    df.to_csv(output_file, index=False)
    print('Merged files into', output_file)


merge_files("/Users/sayems_mac/BixiMatch/data/data/BixiMontrealRentals2014", '/Users/sayems_mac/BixiMatch/data/OD/OD_2014')

['OD_2014-04.csv', 'OD_2014-05.csv', 'OD_2014-06.csv', 'OD_2014-07.csv', 'OD_2014-08.csv', 'OD_2014-09.csv', 'OD_2014-10.csv', 'OD_2014-11.csv']
Merged files into /Users/sayems_mac/BixiMatch/data/OD/OD_2014

In [26]:
merge_files("/Users/sayems_mac/BixiMatch/data/data/BixiMontrealRentals2015", '/Users/sayems_mac/BixiMatch/data/OD/OD_2015')

['OD_2015-04.csv', 'OD_2015-05.csv', 'OD_2015-06.csv', 'OD_2015-07.csv', 'OD_2015-08.csv', 'OD_2015-09.csv', 'OD_2015-10.csv', 'OD_2015-11.csv']
Merged files into /Users/sayems_mac/BixiMatch/data/OD/OD_2015

In [27]:
merge_files("/Users/sayems_mac/BixiMatch/data/data/BixiMontrealRentals2016", '/Users/sayems_mac/BixiMatch/data/OD/OD_2016')

['OD_2016-04.csv', 'OD_2016-05.csv', 'OD_2016-06.csv', 'OD_2016-07.csv', 'OD_2016-08.csv', 'OD_2016-09.csv', 'OD_2016-10.csv', 'OD_2016-11.csv']
Merged files into /Users/sayems_mac/BixiMatch/data/OD/OD_2016

In [28]:
merge_files("/Users/sayems_mac/BixiMatch/data/data/2017", '/Users/sayems_mac/BixiMatch/data/OD/OD_2017')

['OD_2017-04.csv', 'OD_2017-05.csv', 'OD_2017-06.csv', 'OD_2017-07.csv', 'OD_2017-08.csv', 'OD_2017-09.csv', 'OD_2017-10.csv', 'OD_2017-11.csv']
Merged files into /Users/sayems_mac/BixiMatch/data/OD/OD_2017

### Step:2 - Check the data types of the columns and convert the columns to the correct data types

In [29]:
# open the file and check shape , column types , missing values , shape

def check_file(file):
    df = pd.read_csv(file)
    print(df.shape)
    print(df.dtypes)
    print(df.isnull().sum())
    return df

In [30]:
OD_2014 = check_file('/Users/sayems_mac/BixiMatch/data/OD/OD_2014')
OD_2014.head()

(3136276, 6)
start_date            object
start_station_code     int64
end_date              object
end_station_code       int64
duration_sec           int64
is_member              int64
dtype: object
start_date            0
start_station_code    0
end_date              0
end_station_code      0
duration_sec          0
is_member             0
dtype: int64

,start_date,start_station_code,end_date,end_station_code,duration_sec,is_member
0,2014-04-15 00:01,6209,2014-04-15 00:18,6436,1061,1
1,2014-04-15 00:01,6214,2014-04-15 00:11,6248,615,1
2,2014-04-15 00:01,6164,2014-04-15 00:18,6216,1031,1
3,2014-04-15 00:01,6214,2014-04-15 00:24,6082,1382,1
4,2014-04-15 00:02,6149,2014-04-15 00:08,6265,347,1

In [31]:
OD_2015 = check_file('/Users/sayems_mac/BixiMatch/data/OD/OD_2015')
OD_2015.head()

(3443883, 6)
start_date            object
start_station_code     int64
end_date              object
end_station_code       int64
duration_sec           int64
is_member              int64
dtype: object
start_date            0
start_station_code    0
end_date              0
end_station_code      0
duration_sec          0
is_member             0
dtype: int64

,start_date,start_station_code,end_date,end_station_code,duration_sec,is_member
0,2015-04-15 00:00,6164,2015-04-15 00:14,6216,866,1
1,2015-04-15 00:00,6192,2015-04-15 00:06,6158,388,1
2,2015-04-15 00:01,6140,2015-04-15 00:22,6040,1229,1
3,2015-04-15 00:02,6140,2015-04-15 00:22,6040,1200,0
4,2015-04-15 00:02,6209,2015-04-15 00:09,6003,414,1

In [32]:
OD_2016 = check_file('/Users/sayems_mac/BixiMatch/data/OD/OD_2016')
OD_2016.head()

(4000080, 6)
start_date            object
start_station_code     int64
end_date              object
end_station_code       int64
duration_sec           int64
is_member              int64
dtype: object
start_date            0
start_station_code    0
end_date              0
end_station_code      0
duration_sec          0
is_member             0
dtype: int64

,start_date,start_station_code,end_date,end_station_code,duration_sec,is_member
0,2016-04-15 00:00,6315,2016-04-15 00:05,6315,349,1
1,2016-04-15 00:00,6019,2016-04-15 00:29,6347,1720,1
2,2016-04-15 00:00,6219,2016-04-15 00:05,6219,284,1
3,2016-04-15 00:03,6211,2016-04-15 00:07,6307,238,1
4,2016-04-15 00:04,6312,2016-04-15 00:19,6312,910,1

In [33]:
OD_2017 = check_file('/Users/sayems_mac/BixiMatch/data/OD/OD_2017')
OD_2017.head()

(4740357, 6)
start_date            object
start_station_code     int64
end_date              object
end_station_code       int64
duration_sec           int64
is_member              int64
dtype: object
start_date            0
start_station_code    0
end_date              0
end_station_code      0
duration_sec          0
is_member             0
dtype: int64

,start_date,start_station_code,end_date,end_station_code,duration_sec,is_member
0,2017-04-15 00:00,7060,2017-04-15 00:31,7060,1841,1
1,2017-04-15 00:01,6173,2017-04-15 00:10,6173,553,1
2,2017-04-15 00:01,6203,2017-04-15 00:04,6204,195,1
3,2017-04-15 00:01,6104,2017-04-15 00:06,6114,285,1
4,2017-04-15 00:01,6174,2017-04-15 00:11,6174,569,1

### Step:3 - Convert the date column to datetime format

In [35]:
def convert_datetime(df):
    df['start_date'] = pd.to_datetime(df['start_date'])
    df['end_date'] = pd.to_datetime(df['end_date'])
    return df

In [36]:
OD_2014 = convert_datetime(OD_2014)
OD_2014.dtypes

start_date            datetime64[ns]
start_station_code             int64
end_date              datetime64[ns]
end_station_code               int64
duration_sec                   int64
is_member                      int64
dtype: object

In [37]:
OD_2015 = convert_datetime(OD_2015)
OD_2015.dtypes

start_date            datetime64[ns]
start_station_code             int64
end_date              datetime64[ns]
end_station_code               int64
duration_sec                   int64
is_member                      int64
dtype: object

In [38]:
OD_2016 = convert_datetime(OD_2016)
OD_2016.dtypes

start_date            datetime64[ns]
start_station_code             int64
end_date              datetime64[ns]
end_station_code               int64
duration_sec                   int64
is_member                      int64
dtype: object

In [39]:
OD_2017 = convert_datetime(OD_2017)
OD_2017.dtypes

start_date            datetime64[ns]
start_station_code             int64
end_date              datetime64[ns]
end_station_code               int64
duration_sec                   int64
is_member                      int64
dtype: object

### Step:4 - Check the data types , missing values , data head of weather data

In [40]:
humidity = check_file('/Users/sayems_mac/BixiMatch/data/weather/humidity.csv')
humidity.head()

(45253, 37)
datetime              object
Vancouver            float64
Portland             float64
San Francisco        float64
Seattle              float64
Los Angeles          float64
San Diego            float64
Las Vegas            float64
Phoenix              float64
Albuquerque          float64
Denver               float64
San Antonio          float64
Dallas               float64
Houston              float64
Kansas City          float64
Minneapolis          float64
Saint Louis          float64
Chicago              float64
Nashville            float64
Indianapolis         float64
Atlanta              float64
Detroit              float64
Jacksonville         float64
Charlotte            float64
Miami                float64
Pittsburgh           float64
Toronto              float64
Philadelphia         float64
New York             float64
Montreal             float64
Boston               float64
Beersheba            float64
Tel Aviv District    float64
Eilat                float64
Haifa                float64
Nahariyya            float64
Jerusalem            float64
dtype: object
datetime                0
Vancouver            1826
Portland              449
San Francisco         942
Seattle               289
Los Angeles           152
San Diego             344
Las Vegas             842
Phoenix              1308
Albuquerque           710
Denver               1808
San Antonio           564
Dallas                319
Houston               121
Kansas City           512
Minneapolis           510
Saint Louis          1289
Chicago              1109
Nashville             567
Indianapolis          695
Atlanta               422
Detroit               862
Jacksonville          209
Charlotte             589
Miami                1087
Pittsburgh            522
Toronto               728
Philadelphia          624
New York             1624
Montreal             1696
Boston                449
Beersheba             859
Tel Aviv District    1113
Eilat                 970
Haifa                 818
Nahariyya             817
Jerusalem             906
dtype: int64

,datetime,Vancouver,Portland,San Francisco,Seattle,Los Angeles,San Diego,Las Vegas,Phoenix,Albuquerque,...,Philadelphia,New York,Montreal,Boston,Beersheba,Tel Aviv District,Eilat,Haifa,Nahariyya,Jerusalem
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,25.0,NaN,NaN,NaN
1,2012-10-01 13:00:00,76.0,81.0,88.0,81.0,88.0,82.0,22.0,23.0,50.0,...,71.0,58.0,93.0,68.0,50.0,63.0,22.0,51.0,51.0,50.0
2,2012-10-01 14:00:00,76.0,80.0,87.0,80.0,88.0,81.0,21.0,23.0,49.0,...,70.0,57.0,91.0,68.0,51.0,62.0,22.0,51.0,51.0,50.0
3,2012-10-01 15:00:00,76.0,80.0,86.0,80.0,88.0,81.0,21.0,23.0,49.0,...,70.0,57.0,87.0,68.0,51.0,62.0,22.0,51.0,51.0,50.0
4,2012-10-01 16:00:00,77.0,80.0,85.0,79.0,88.0,81.0,21.0,23.0,49.0,...,69.0,57.0,84.0,68.0,52.0,62.0,22.0,51.0,51.0,50.0

#### OOPS: I don't need others cities data, I will only use the data of the city of Montreal

In [41]:
pressure = check_file('/Users/sayems_mac/BixiMatch/data/weather/pressure.csv')

temperature = check_file('/Users/sayems_mac/BixiMatch/data/weather/temperature.csv')

wind_speed = check_file('/Users/sayems_mac/BixiMatch/data/weather/wind_speed.csv')

weather_description = check_file('/Users/sayems_mac/BixiMatch/data/weather/weather_description.csv')

# just filter the weather data for montreal

def filter_weather(df):
    return df.filter(items=['datetime','Montreal'])

humidity = filter_weather(humidity)
pressure = filter_weather(pressure)
temperature = filter_weather(temperature)
wind_speed = filter_weather(wind_speed)
weather_description = filter_weather(weather_description)

weather_description.head()

(45253, 37)
datetime              object
Vancouver            float64
Portland             float64
San Francisco        float64
Seattle              float64
Los Angeles          float64
San Diego            float64
Las Vegas            float64
Phoenix              float64
Albuquerque          float64
Denver               float64
San Antonio          float64
Dallas               float64
Houston              float64
Kansas City          float64
Minneapolis          float64
Saint Louis          float64
Chicago              float64
Nashville            float64
Indianapolis         float64
Atlanta              float64
Detroit              float64
Jacksonville         float64
Charlotte            float64
Miami                float64
Pittsburgh           float64
Toronto              float64
Philadelphia         float64
New York             float64
Montreal             float64
Boston               float64
Beersheba            float64
Tel Aviv District    float64
Eilat                float64
Haifa                float64
Nahariyya            float64
Jerusalem            float64
dtype: object
datetime                0
Vancouver            4234
Portland                4
San Francisco         815
Seattle                13
Los Angeles           252
San Diego             175
Las Vegas              88
Phoenix               594
Albuquerque           456
Denver                543
San Antonio            17
Dallas                 60
Houston                 9
Kansas City           121
Minneapolis            17
Saint Louis            68
Chicago               725
Nashville             147
Indianapolis          289
Atlanta                49
Detroit                 5
Jacksonville           15
Charlotte               3
Miami                 794
Pittsburgh             46
Toronto               175
Philadelphia            4
New York             1041
Montreal              994
Boston                  7
Beersheba             806
Tel Aviv District     930
Eilat                 792
Haifa                 798
Nahariyya             795
Jerusalem             799
dtype: int64
(45253, 37)
datetime              object
Vancouver            float64
Portland             float64
San Francisco        float64
Seattle              float64
Los Angeles          float64
San Diego            float64
Las Vegas            float64
Phoenix              float64
Albuquerque          float64
Denver               float64
San Antonio          float64
Dallas               float64
Houston              float64
Kansas City          float64
Minneapolis          float64
Saint Louis          float64
Chicago              float64
Nashville            float64
Indianapolis         float64
Atlanta              float64
Detroit              float64
Jacksonville         float64
Charlotte            float64
Miami                float64
Pittsburgh           float64
Toronto              float64
Philadelphia         float64
New York             float64
Montreal             float64
Boston               float64
Beersheba            float64
Tel Aviv District    float64
Eilat                float64
Haifa                float64
Nahariyya            float64
Jerusalem            float64
dtype: object
datetime               0
Vancouver            795
Portland               1
San Francisco        793
Seattle                3
Los Angeles            3
San Diego              1
Las Vegas              1
Phoenix                3
Albuquerque            1
Denver                 1
San Antonio            1
Dallas                 4
Houston                3
Kansas City            1
Minneapolis           13
Saint Louis            1
Chicago                3
Nashville              2
Indianapolis           7
Atlanta                6
Detroit                1
Jacksonville           1
Charlotte              3
Miami                805
Pittsburgh             3
Toronto                1
Philadelphia           3
New York             793
Montreal               3
Boston                 3
Beersheba            798
Tel Aviv District    793
Eilat                792
Haifa                798
Nahariyya            797
Jerusalem            793
dtype: int64
(45253, 37)
datetime              object
Vancouver            float64
Portland             float64
San Francisco        float64
Seattle              float64
Los Angeles          float64
San Diego            float64
Las Vegas            float64
Phoenix              float64
Albuquerque          float64
Denver               float64
San Antonio          float64
Dallas               float64
Houston              float64
Kansas City          float64
Minneapolis          float64
Saint Louis          float64
Chicago              float64
Nashville            float64
Indianapolis         float64
Atlanta              float64
Detroit              float64
Jacksonville         float64
Charlotte            float64
Miami                float64
Pittsburgh           float64
Toronto              float64
Philadelphia         float64
New York             float64
Montreal             float64
Boston               float64
Beersheba            float64
Tel Aviv District    float64
Eilat                float64
Haifa                float64
Nahariyya            float64
Jerusalem            float64
dtype: object
datetime               0
Vancouver            795
Portland               1
San Francisco        794
Seattle                1
Los Angeles            1
San Diego              1
Las Vegas             15
Phoenix                2
Albuquerque            4
Denver                 2
San Antonio            1
Dallas                 2
Houston                3
Kansas City            1
Minneapolis            3
Saint Louis            1
Chicago                1
Nashville              3
Indianapolis           1
Atlanta                1
Detroit                1
Jacksonville           1
Charlotte              2
Miami                795
Pittsburgh             1
Toronto                1
Philadelphia           2
New York             793
Montreal               1
Boston                 1
Beersheba            793
Tel Aviv District    794
Eilat                792
Haifa                795
Nahariyya            794
Jerusalem            794
dtype: int64
(45253, 37)
datetime             object
Vancouver            object
Portland             object
San Francisco        object
Seattle              object
Los Angeles          object
San Diego            object
Las Vegas            object
Phoenix              object
Albuquerque          object
Denver               object
San Antonio          object
Dallas               object
Houston              object
Kansas City          object
Minneapolis          object
Saint Louis          object
Chicago              object
Nashville            object
Indianapolis         object
Atlanta              object
Detroit              object
Jacksonville         object
Charlotte            object
Miami                object
Pittsburgh           object
Toronto              object
Philadelphia         object
New York             object
Montreal             object
Boston               object
Beersheba            object
Tel Aviv District    object
Eilat                object
Haifa                object
Nahariyya            object
Jerusalem            object
dtype: object
datetime               0
Vancouver            793
Portland               1
San Francisco        793
Seattle                1
Los Angeles            1
San Diego              1
Las Vegas              1
Phoenix                1
Albuquerque            1
Denver                 1
San Antonio            1
Dallas                 1
Houston                1
Kansas City            1
Minneapolis            1
Saint Louis            1
Chicago                1
Nashville              1
Indianapolis           1
Atlanta                1
Detroit                1
Jacksonville           1
Charlotte              1
Miami                793
Pittsburgh             1
Toronto                1
Philadelphia           1
New York             793
Montreal               1
Boston                 1
Beersheba            793
Tel Aviv District    793
Eilat                792
Haifa                793
Nahariyya            793
Jerusalem            793
dtype: int64

              datetime         Montreal
0  2012-10-01 12:00:00              NaN
1  2012-10-01 13:00:00  overcast clouds
2  2012-10-01 14:00:00     sky is clear
3  2012-10-01 15:00:00     sky is clear
4  2012-10-01 16:00:00     sky is clear

### Step:5 - Change the date column into datetime format

In [42]:
def convert_datetime(df):
    df['datetime'] = pd.to_datetime(df['datetime'])
    return df


humidity = convert_datetime(humidity)
pressure = convert_datetime(pressure)
temperature = convert_datetime(temperature)
wind_speed = convert_datetime(wind_speed)
weather_description = convert_datetime(weather_description)

humidity.dtypes

wind_speed.head()

             datetime  Montreal
0 2012-10-01 12:00:00       NaN
1 2012-10-01 13:00:00       4.0
2 2012-10-01 14:00:00       4.0
3 2012-10-01 15:00:00       4.0
4 2012-10-01 16:00:00       4.0

### Step:6 - Merge all the weather data into one file

In [43]:
# Merge weather_description and temperature
weather = weather_description.merge(temperature, on='datetime')

# Merge the result with pressure
weather = weather.merge(pressure, on='datetime')

# Merge the result with wind_speed
weather = weather.merge(wind_speed, on='datetime' ,suffixes=('', '_wind_speed'))

# Rename columns as necessary
weather.columns = ['Datetime', 'Description', 'Temperature', 'Pressure', 'Wind_speed']

# Convert temperature to Celsius
weather['Temperature_C'] = weather['Temperature'] - 273.15

# Display the first few rows to verify the result
weather.head()

,Datetime,Description,Temperature,Pressure,Wind_speed,Temperature_C
0,2012-10-01 12:00:00,NaN,NaN,NaN,NaN,NaN
1,2012-10-01 13:00:00,overcast clouds,285.830000,1001.0,4.0,12.680000
2,2012-10-01 14:00:00,sky is clear,285.834650,986.0,4.0,12.684650
3,2012-10-01 15:00:00,sky is clear,285.847790,945.0,4.0,12.697790
4,2012-10-01 16:00:00,sky is clear,285.860929,904.0,4.0,12.710929

#### now again for safety check for missing values

In [45]:
def check_null(df):
    return df.isnull().sum()

check_null(weather)

Datetime           0
Description        1
Temperature        3
Pressure         994
Wind_speed         1
Temperature_C      3
dtype: int64

### Step:7 - Imputing missing values

In [290]:
# impute missing values with median

def impute_missing():
    weather['Temperature'] = weather['Temperature'].fillna(weather['Temperature'].median())
    weather['Pressure'] = weather['Pressure'].fillna(weather['Pressure'].median())
    weather['Wind_speed'] = weather['Wind_speed'].fillna(weather['Wind_speed'].median())
    weather['Description'] = weather['Description'].fillna(weather['Description'].mode()[0])

impute_missing()

check_null(weather)

Datetime         0
Description      0
Temperature      0
Pressure         0
Wind_speed       0
Temperature_C    3
dtype: int64

In [46]:
# drop the missing rows in OD data

def drop_missing(df):
    return df.dropna()

weather = drop_missing(weather)

check_null(weather)

Datetime         0
Description      0
Temperature      0
Pressure         0
Wind_speed       0
Temperature_C    0
dtype: int64

### Step:8 - Merge the weather data with the bike data & save for future use

In [47]:
def merge_OD_weather(OD, weather):
    return OD.merge(weather, left_on='start_date', right_on='Datetime').drop('Datetime', axis=1)

In [48]:
OD_2014 = merge_OD_weather(OD_2014, weather)

OD_2014.head()

,start_date,start_station_code,end_date,end_station_code,duration_sec,is_member,Description,Temperature,Pressure,Wind_speed,Temperature_C
0,2014-04-15 03:00:00,6411,2014-04-15 03:26:00,6231,1555,1,light rain,288.05,1003.0,5.0,14.90
1,2014-04-15 06:00:00,6213,2014-04-15 06:11:00,6067,687,1,light rain,287.31,1003.0,3.0,14.16
2,2014-04-15 06:00:00,6169,2014-04-15 06:06:00,6265,321,1,light rain,287.31,1003.0,3.0,14.16
3,2014-04-15 08:00:00,6734,2014-04-15 08:44:00,6099,2655,1,light rain,286.64,1002.0,3.0,13.49
4,2014-04-15 08:00:00,6087,2014-04-15 08:13:00,6202,798,1,light rain,286.64,1002.0,3.0,13.49

In [49]:
OD_2015 = merge_OD_weather(OD_2015, weather)
OD_2016 = merge_OD_weather(OD_2016, weather)
OD_2017 = merge_OD_weather(OD_2017, weather)

# save the merged files

OD_2014.to_csv('/Users/sayems_mac/BixiMatch/data/OD/OD_2014_weather.csv', index=False)
OD_2015.to_csv('/Users/sayems_mac/BixiMatch/data/OD/OD_2015_weather.csv', index=False)
OD_2016.to_csv('/Users/sayems_mac/BixiMatch/data/OD/OD_2016_weather.csv', index=False)
OD_2017.to_csv('/Users/sayems_mac/BixiMatch/data/OD/OD_2017_weather.csv', index=False)